[
  "Crée un carnet de gratitude numérique.",
  "Construis un pot connecté qui t’avertit quand arroser tes plantes.",
  "Développe une app pour apprendre 5 mots d’une langue par jour.",
  "Lance un défi 30 jours de productivité.",
  "Fabrique un réveil qui diffuse des citations motivantes.",
  "Code une IA qui te suggère un hobby selon ton humeur.",
  "Dessine ton logo personnel.",
  "Écris une courte histoire chaque jour pendant un mois.",
  "Apprends à créer un jeu vidéo simple avec Unity.",
  "Réinvente ta routine du matin.",
  "Apprends à utiliser un Raspberry Pi pour automatiser ta maison.",
  "Crée une playlist pour chaque émotion.",
  "Fabrique une lampe qui change de couleur selon la météo.",
  "Crée un site web pour ton portfolio ou ton CV interactif.",
  "Construis une boîte à idées connectée avec un bouton pour enregistrer tes pensées.",
  "Code une appli de méditation minimaliste.",
  "Fais un herbier numérique avec reconnaissance des plantes.",
  "Crée une horloge qui affiche ton niveau d’énergie supposé selon l'heure.",
  "Développe une carte interactive de tes lieux préférés.",
  "Apprends à faire du stop motion avec ton téléphone.",
  "Imagine un assistant vocal personnalisé.",
  "Lance un micro-journal quotidien avec photos et une phrase.",
  "Code une boîte qui affiche des compliments au hasard.",
  "Écris une lettre à ton futur toi tous les mois.",
  "Crée une checklist de tes rêves à accomplir.",
  "Développe un tracker de temps passé sur tes passions.",
  "Fabrique un panneau LED qui affiche des objectifs quotidiens.",
  "Automatise l’envoi de messages motivants à tes amis.",
  "Apprends à faire des animations avec Processing ou p5.js.",
  "Invente ton propre alphabet ou code secret.",
  "Fais une bande-son de ta vie.",
  "Crée une appli de défis créatifs quotidiens.",
  "Développe une mini-encyclopédie personnelle de ce que tu apprends.",
  "Construis un robot qui te dit bonjour le matin.",
  "Crée une base de données de citations et d'idées inspirantes.",
  "Lance un mini blog d’idées folles ou inutiles… mais géniales.",
  "Écris chaque jour une ligne de code sans but précis.",
  "Crée un fond d’écran animé avec tes buts.",
  "Dessine ton moodboard de l’année.",
  "Transforme un objet du quotidien en œuvre d’art ou projet tech."
]
